export const COOKIE_KEY = 'userInfo_nft_2024'; // 防止和其他页面搞混

export const idMap = {
  0: {
    name: '白羊座',
    date: '3.21-4.19',
    tips: '这是一个充满魅力的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—白羊座，拥有勇敢的保护力，直率乐观、能量担当，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  1: {
    name: '金牛座',
    date: '4.20-5.20',
    tips: '这是一个神秘莫测的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—金牛座，拥有率真的保护力，运筹帷幄、理财高手，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  2: {
    name: '双子座',
    date: '5.21-6.21',
    tips: '这是一个C位出道的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—双子座，拥有机智的保护力，出类拔萃、C位出道，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  3: {
    name: '巨蟹座',
    date: '6.22-7.22',
    tips: '这是一个颜值担当的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—巨蟹座，拥有真诚的保护力，重情重义、纯爱战神，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  4: {
    name: '狮子座',
    date: '7.23-8.22',
    tips: '这是一个气氛担当的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—狮子座，拥有霸气的保护力，CARRY全场、LEADER担当，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  5: {
    name: '处女座',
    date: '8.23-9.22',
    tips: '这是一个浪漫匠人的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—处女座，拥有完美的保护力，张弛有度、规划达人，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  6: {
    name: '天秤座',
    date: '9.23-10.23',
    tips: '这是一个天马行空的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—天秤座，拥有平衡的保护力，优雅从容、颜值担当，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  7: {
    name: '天蝎座',
    date: '10.24-11.22',
    tips: '这是一个善解人意的星座',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—天蝎座，拥有神秘的保护力，敏锐洞察、最强大脑，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  8: {
    name: '射手座',
    date: '11.23-12.21',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—射手座，拥有自由的保护力，自在如风、气氛担当，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  9: {
    name: '摩羯座',
    date: '12.22-1.19',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—摩羯座，拥有踏实的保护力，成熟稳重、劳模本人，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  10: {
    name: '水瓶座',
    date: '1.20-2.18',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—水瓶座，拥有创新的保护力，天马行空、创意达人，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  11: {
    name: '双鱼座',
    date: '2.19-3.20',
    desc: 'Mama100首批会员NFT藏品，将12星座特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—双鱼座，拥有浪漫的保护力，善解人意、EQ王者，如同星座所承载的专属合生元保护力，陪伴着您成长。',
  },
  101: {
    name: '隐藏款龙年限定NFT丁丁',
    detailName: '龙年特别版',
    desc: 'Mama100首批会员NFT藏品，将龙年特质与合生元IP丁丁趣味结合，打造会员专属元宇宙，让会员在Mama100 space 遨游探索。丁丁—龙年特别版，拥有龙的本命保护力， 龘吉龘利、龙行大运，如同龙年所承载的专属合生元保护力，陪伴您开启新兴向“龙”的一年！',
  },
  201: { name: '限定红包封面' },
  202: { name: '隐藏款龙年限定红包封面' },
};

export const nameList = [
  '白羊座',
  '金牛座',
  '双子座',
  '巨蟹座',
  '狮子座',
  '处女座',
  '天秤座',
  '天蝎座',
  '射手座',
  '摩羯座',
  '水瓶座',
  '双鱼座',
  '隐藏款',
];

// 是否是红包封面
export const getIsRedpacket = (id) => [201, 202].includes(id);
// 是否已经有龙卡了
export const getHasLong = (list) => list.find((i) => [101].includes(i.card_id));

export const getCardName = (id) => idMap[id]?.name;

// 根据 card_id 属性去重
export const uniqueArray = (arr) =>
  arr.filter(
    (item, index, self) =>
      index === self.findIndex((i) => i.card_id === item.card_id),
  );

// 获取仅12星座卡片
export const getOnly12Card = (list) =>
  uniqueArray(list.filter((i) => i.card_id >= 0 && i.card_id <= 11));

// 会员等级介绍页面
export const memberLevelUrl =
  'https://www.mama100.com/wmall/activityDemo/shoppingGuideNew/index.html?_campaign=20240120222950_24824';
